{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "batch_input_shape": [null, 28, 28, 1], "bias_constraint": null, "kernel_regularizer": null, "filters": 32, "use_bias": true, "bias_regularizer": null, "name": "conv2d_1", "dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "activation": "relu", "kernel_constraint": null, "dtype": "float32", "padding": "same"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [4, 4], "bias_constraint": null, "kernel_regularizer": null, "filters": 32, "use_bias": true, "bias_regularizer": null, "name": "conv2d_2", "dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "activation": "relu", "kernel_constraint": null, "padding": "same"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.3, "name": "dropout_1", "noise_shape": null, "seed": null}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "filters": 64, "use_bias": true, "bias_regularizer": null, "name": "conv2d_3", "dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "activation": "relu", "kernel_constraint": null, "padding": "same"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "filters": 64, "use_bias": true, "bias_regularizer": null, "name": "conv2d_4", "dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "activation": "relu", "kernel_constraint": null, "padding": "same"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.3, "name": "dropout_2", "noise_shape": null, "seed": null}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "filters": 64, "use_bias": true, "bias_regularizer": null, "name": "conv2d_5", "dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "activation": "relu", "kernel_constraint": null, "padding": "same"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "filters": 64, "use_bias": true, "bias_regularizer": null, "name": "conv2d_6", "dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "activation": "relu", "kernel_constraint": null, "padding": "same"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.3, "name": "dropout_3", "noise_shape": null, "seed": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "units": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "units": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "name": "dense_2", "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "name": "dropout_4", "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "units": 10, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "name": "dense_3", "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "activation": "softmax"}}], "backend": "tensorflow", "keras_version": "2.1.5"}